Revit 2027 API
RebarBendingDetailType.BendDiameterDimensionsForSegmentsEnabled Property
 Identifies if radial or diameter dimensions will be shown for the bends between segments. Radial or diameter dimesions for arc segments will be shown by default. This property has a menaning only if BendDiameterDimensionsEnabled is set to true.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool BendDiameterDimensionsForSegmentsEnabled { get; set; }
Public Property BendDiameterDimensionsForSegmentsEnabled As Boolean
	Get
	Set
public:
property bool BendDiameterDimensionsForSegmentsEnabled {
	bool get ();
	void set (bool value);
}
member BendDiameterDimensionsForSegmentsEnabled : bool with get, set
Property Value
Boolean
See Also
Reference
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace